Documents/ВыплатаЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВыплатаЗаработнойПлаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолжностьПередСторудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗадолжностьПередСторудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолжностьПередСторудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВыплатаЗаработнойПлаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
       // регистр ЗадолжностьПередСторудниками Расход
    Движения.ЗадолжностьПередСторудниками.Записывать = Истина;
    Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
        Движение = Движения.ЗадолжностьПередСторудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
        Движение.Долг = ТекСтрокаСотрудники.СуммаВыплат;
    КонецЦикла;

   
КонецПроцедуры
